#

In [1]:
import pandas as pd

In [2]:
data = {
    'name': ['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola'],
    'continent': ['Asia', 'Europe', 'Africa', 'Europe', 'Africa'],
    'area': [652230, 28748, 2381741, 468, 1246700],
    'population': [25500100, 2831741, 37100000, 78115, 20609294],
    'gdp': [20343000000, 12960000000, 188681000000, 3712000000, 100990000000]
}

In [3]:
countries_info = pd.DataFrame(data)

In [4]:
countries_info

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [20]:
# if countries_info['area'] >= 3000000 or countries_info['population'] >= 25000000:
#     countries_info

In [7]:
countries_info

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [36]:
x = lambda a, b, c : a + b + c
print(x(5, 6, 2))

13

In [ ]:
countries_info[countries_info['area'] >= 3000000]
countries_info[countries_info['population'] >= 25000000]

In [41]:
filtered_countries = countries_info[(countries_info['area'] >= 3000000) | (countries_info['population'] >= 25000000)]

In [43]:
filtered_countries[['name', 'area', 'population']]

          name     area  population
0  Afghanistan   652230    25500100
2      Algeria  2381741    37100000

# Groupby

In [44]:
data = {
    'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'sales': [200,120,340,124,243,350]
}

In [58]:
df = pd.DataFrame(data)

In [59]:
df

  company   person  sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [47]:
groupedby_company = df.groupby('company')

In [48]:
groupedby_company.sum()

             person  sales
company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [53]:
groupedby_company.min()

          person  sales
company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [55]:
groupedby_company.max()

          person  sales
company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [54]:
groupedby_company.describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [60]:
groupedby_company.describe().transpose()

company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000